Revit 2026 API

# ExternalDBApplicationResult Enumeration

---

Informs Autodesk Revit of the status of your external db application after execution.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ExternalDBApplicationResult
```
```vb
Public Enumeration ExternalDBApplicationResult
```
```cpp
public enum class ExternalDBApplicationResult
```
```fsharp
type ExternalDBApplicationResult
```

| Member name | Value | Description |
| --- | --- | --- |
| Failed | -1 | The external db application was unable to complete its task. |
| Succeeded | 0 | The external db application completed successfully. Autodesk Revit will keep this object during the entire Revit session. |

#### Reference

Autodesk.Revit.DB Namespace